nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]


backbone:
  - [-1, 1, HGStem, [16, 32]]  # 0-P2/4

  - [0, 1, C2f, [32]] # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]] # 2-P3/8
  - [-1, 1, C2f, [64]] # 3-P3/8

  - [0, 3, HGBlock, [16, 32, 3]] # 4-P2/4
  - [-1, 1, DWConv, [64, 3, 2, 1, False]]  # 5-P3/8
  - [-1, 3, HGBlock, [32, 64, 3]]   # 6-P3/8

  - [[3, 6], 1, DynamicAlignFusion, [64]] # 7-P3/8

  - [7, 1, Conv, [128, 3, 2]]  # 8-P4/16
  - [-1, 1, C2f, [128]] # 9-P4/16

  - [7, 1, DWConv, [128, 3, 2, 1, False]]  # 10-P4/16
  - [-1, 3, HGBlock, [64, 128, 5, True, False]]  #   11  cm, c2, k, light, shortcut
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]#      12
  - [-1, 3, HGBlock, [64, 128, 5, True, True]]  #    13-P4/16

  - [[9, 13], 1, DynamicAlignFusion, [128]] # 14-P4/16

  - [14, 1, Conv, [256, 3, 2]]  # 15-P5/32
  - [-1, 3, C2f, [256]] # 16-P5/32

  - [14, 1, DWConv, [256, 3, 2, 1, False]]  # 17-P5/32
  - [-1, 3, HGBlock, [128, 256, 5, True, False]]  # 18-P5/32

  - [[16, 18], 1, DynamicAlignFusion, [256]] # 19-P5/32
head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2       20
  - [-1, 1, AIFI, [1024, 8]] # 9                                          21
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0                 22

  - [[22, 12, 5], 1, FocusFeature, []] # 11-P4/16                          23

  - [23, 1, Conv, [256, 3, 2]] # 12-P5/32                                 24
  - [[-1, 19], 1, Concat, [1]] # 13                                        25
  - [-1, 4, RepC3, [256, 0.5]] # 14-P5/32                                 26

  - [23, 1, nn.Upsample, [None, 2, 'nearest']] # 15-P3/8                  27
  - [[-1, 5], 1, Concat, [1]]                 #                           28
  - [-1, 4, RepC3, [256, 0.5]]  # 17-P3/8                                 29

  - [[26, 23, 29], 1, FocusFeature, []] # 18-P4/16                        30

  - [30, 1, Conv, [256, 3, 2]] # 19-P5/32                                 31
  - [[24, 31, 26], 1, Concat, [1]]           #                            32
  - [-1, 4, RepC3, [256, 0.5]]  # 21-P5/32                                33

  - [30, 1, nn.Upsample, [None, 2, 'nearest']] # 22-P3/8                  34
  - [[27, 34, 29], 1, Concat, [1]]  #                                     35
  - [-1, 4, RepC3, [256, 0.5]]  # 24-P3/8                                 36


  - [[36, 30, 33], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)
